#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warnings:

- Deprecated Resource
  on modules/vertex-ai-workbench/main.tf line 49

To see the full warning notes, run Terraform without -compact-warnings.
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.google_client_config.provider: Reading...
module.gcr.google_project_service.api["artifactregistry.googleapis.com"]: Refreshing state... [id=tbd-2024l-3108510/artifactregistry.googleapis.com]
module.vpc.module.vpc.module.vpc.google_compute_network.network: Refreshing state... [id=projects/tbd-2024l-3108510/global/networks/main-vpc]
module.data-pipelines.google_storage_bucket.tbd-code-bucket: Refreshing state... [id=tbd-2024l-3108510-code]
module.data-pipelines.google_storage_bucket.tbd-data-bucket: Refreshing state... [id=tbd-2024l-3108510-data]
data.google_client_config.provider: Read complete after 0s [id=projects/"tbd-2024l-3108510"/regions/"europe-west1"/zones/<null>]
module.data-pipelines.google_storage_bucket_object.job-code["spark-job.py"]: Refreshing state... [id=tbd-2024l-3108510-code-spark-job.py]
module.vpc.google_compute_firewall.fw-allow-ingress-from-iap: Refreshing state... [id=projects/tbd-2024l-3108510/global/firewalls/fw-allow-ingress-iap]
module.vpc.google_compute_firewall.default-internal-allow-all: Refreshing state... [id=projects/tbd-2024l-3108510/global/firewalls/default-internal-allow-all]
module.vpc.module.vpc.module.subnets.google_compute_subnetwork.subnetwork["europe-west1/subnet-01"]: Refreshing state... [id=projects/tbd-2024l-3108510/regions/europe-west1/subnetworks/subnet-01]
module.vpc.module.cloud-router.google_compute_router.router: Refreshing state... [id=projects/tbd-2024l-3108510/regions/europe-west1/routers/nat-router]
google_compute_firewall.allow-all-internal: Refreshing state... [id=projects/tbd-2024l-3108510/global/firewalls/allow-all-internal]
module.vpc.module.cloud-router.google_compute_router_nat.nats["nat-gateway"]: Refreshing state... [id=tbd-2024l-3108510/europe-west1/nat-router/nat-gateway]
module.vpc.module.vpc.module.routes.google_compute_route.route["egress-internet"]: Refreshing state... [id=projects/tbd-2024l-3108510/global/routes/egress-internet]
module.dataproc.google_project_service.dataproc: Refreshing state... [id=tbd-2024l-3108510/dataproc.googleapis.com]
module.composer.google_service_account.tbd-composer-sa: Refreshing state... [id=projects/tbd-2024l-3108510/serviceAccounts/tbd-2024l-3108510-data@tbd-2024l-3108510.iam.gserviceaccount.com]
module.composer.google_project_service.api["composer.googleapis.com"]: Refreshing state... [id=tbd-2024l-3108510/composer.googleapis.com]
module.composer.google_compute_subnetwork.composer-subnet: Refreshing state... [id=projects/tbd-2024l-3108510/regions/europe-west1/subnetworks/composer-subnet-01]
module.data-pipelines.google_storage_bucket_iam_member.tbd-data-bucket-iam-editor: Refreshing state... [id=b/tbd-2024l-3108510-data/roles/storage.objectUser/serviceAccount:tbd-2024l-3108510-data@tbd-2024l-3108510.iam.gserviceaccount.com]
module.composer.google_project_iam_member.dataproc-editor-iam: Refreshing state... [id=tbd-2024l-3108510/roles/dataproc.editor/serviceAccount:tbd-2024l-3108510-data@tbd-2024l-3108510.iam.gserviceaccount.com]
module.data-pipelines.google_storage_bucket_iam_member.tbd-code-bucket-iam-viewer: Refreshing state... [id=b/tbd-2024l-3108510-code/roles/storage.objectViewer/serviceAccount:tbd-2024l-3108510-data@tbd-2024l-3108510.iam.gserviceaccount.com]
module.composer.google_project_iam_member.dataproc-sa-user-iam: Refreshing state... [id=tbd-2024l-3108510/roles/iam.serviceAccountUser/serviceAccount:tbd-2024l-3108510-data@tbd-2024l-3108510.iam.gserviceaccount.com]
module.composer.google_project_iam_member.composer-member: Refreshing state... [id=tbd-2024l-3108510/roles/composer.worker/serviceAccount:tbd-2024l-3108510-data@tbd-2024l-3108510.iam.gserviceaccount.com]
module.composer.module.composer.google_project_iam_member.composer_agent_service_account[0]: Refreshing state... [id=tbd-2024l-3108510/roles/composer.ServiceAgentV2Ext/serviceAccount:service-577259952691@cloudcomposer-accounts.iam.gserviceaccount.com]
module.gcr.google_artifact_registry_repository.registry: Refreshing state... [id=projects/tbd-2024l-3108510/locations/europe/repositories/eu.gcr.io]
module.dataproc.google_dataproc_cluster.tbd-dataproc-cluster: Refreshing state... [id=projects/tbd-2024l-3108510/regions/europe-west1/clusters/tbd-cluster]
module.jupyter_docker_image.docker_image.jupyter: Refreshing state... [id=sha256:012edad709be13ed5a12dfc8a849c20957d1c89cfa0b0b19607d0cbb6afaeb2beu.gcr.io/tbd-2024l-3108510/jupyter:3.6.3]
module.jupyter_docker_image.docker_registry_image.jupyterlab: Refreshing state... [id=sha256:552f07fdd6817ed60003f8a7a91dd008a5d60127b76147977d251bd6e8d20f35]
module.vertex_ai_workbench.google_project_service.notebooks: Refreshing state... [id=tbd-2024l-3108510/notebooks.googleapis.com]
module.vertex_ai_workbench.google_project_iam_binding.token_creator_role: Refreshing state... [id=tbd-2024l-3108510/roles/iam.serviceAccountTokenCreator]
module.vertex_ai_workbench.google_storage_bucket.notebook-conf-bucket: Refreshing state... [id=tbd-2024l-3108510-conf]
module.vertex_ai_workbench.google_storage_bucket_iam_binding.binding: Refreshing state... [id=b/tbd-2024l-3108510-conf/roles/storage.objectViewer]
module.vertex_ai_workbench.google_storage_bucket_object.post-startup: Refreshing state... [id=tbd-2024l-3108510-conf-scripts/notebook_post_startup_script.sh]
module.vertex_ai_workbench.google_notebooks_instance.tbd_notebook: Refreshing state... [id=projects/tbd-2024l-3108510/locations/europe-west1-b/instances/tbd-2024l-3108510-notebook]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.jupyter_docker_image.docker_image.jupyter has been deleted
  - resource "docker_image" "jupyter" {
        id       = "sha256:012edad709be13ed5a12dfc8a849c20957d1c89cfa0b0b19607d0cbb6afaeb2beu.gcr.io/tbd-2024l-3108510/jupyter:3.6.3"
      - name     = "eu.gcr.io/tbd-2024l-3108510/jupyter:3.6.3" -> null
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.composer.google_compute_subnetwork.composer-subnet will be destroyed
  # (because module.composer is not in configuration)
  - resource "google_compute_subnetwork" "composer-subnet" {
      - creation_timestamp         = "2024-05-23T07:16:09.093-07:00" -> null
      - gateway_address            = "10.11.0.1" -> null
      - id                         = "projects/tbd-2024l-3108510/regions/europe-west1/subnetworks/composer-subnet-01" -> null
      - ip_cidr_range              = "10.11.0.0/16" -> null
      - name                       = "composer-subnet-01" -> null
      - network                    = "https://www.googleapis.com/compute/v1/projects/tbd-2024l-3108510/global/networks/main-vpc" -> null
      - private_ip_google_access   = true -> null
      - private_ipv6_google_access = "DISABLE_GOOGLE_ACCESS" -> null
      - project                    = "tbd-2024l-3108510" -> null
      - purpose                    = "PRIVATE" -> null
      - region                     = "europe-west1" -> null
      - secondary_ip_range         = [] -> null
      - self_link                  = "https://www.googleapis.com/compute/v1/projects/tbd-2024l-3108510/regions/europe-west1/subnetworks/composer-subnet-01" -> null
      - stack_type                 = "IPV4_ONLY" -> null

      - log_config {
          - aggregation_interval = "INTERVAL_10_MIN" -> null
          - filter_expr          = "true" -> null
          - flow_sampling        = 0.5 -> null
          - metadata             = "INCLUDE_ALL_METADATA" -> null
          - metadata_fields      = [] -> null
        }
    }

  # module.composer.google_project_iam_member.composer-member will be destroyed
  # (because module.composer is not in configuration)
  - resource "google_project_iam_member" "composer-member" {
      - etag    = "BwYZH8YrAGs=" -> null
      - id      = "tbd-2024l-3108510/roles/composer.worker/serviceAccount:tbd-2024l-3108510-data@tbd-2024l-3108510.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:tbd-2024l-3108510-data@tbd-2024l-3108510.iam.gserviceaccount.com" -> null
      - project = "tbd-2024l-3108510" -> null
      - role    = "roles/composer.worker" -> null
    }

  # module.composer.google_project_iam_member.dataproc-editor-iam will be destroyed
  # (because module.composer is not in configuration)
  - resource "google_project_iam_member" "dataproc-editor-iam" {
      - etag    = "BwYZH8YrAGs=" -> null
      - id      = "tbd-2024l-3108510/roles/dataproc.editor/serviceAccount:tbd-2024l-3108510-data@tbd-2024l-3108510.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:tbd-2024l-3108510-data@tbd-2024l-3108510.iam.gserviceaccount.com" -> null
      - project = "tbd-2024l-3108510" -> null
      - role    = "roles/dataproc.editor" -> null
    }

  # module.composer.google_project_iam_member.dataproc-sa-user-iam will be destroyed
  # (because module.composer is not in configuration)
  - resource "google_project_iam_member" "dataproc-sa-user-iam" {
      - etag    = "BwYZH8YrAGs=" -> null
      - id      = "tbd-2024l-3108510/roles/iam.serviceAccountUser/serviceAccount:tbd-2024l-3108510-data@tbd-2024l-3108510.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:tbd-2024l-3108510-data@tbd-2024l-3108510.iam.gserviceaccount.com" -> null
      - project = "tbd-2024l-3108510" -> null
      - role    = "roles/iam.serviceAccountUser" -> null
    }

  # module.composer.google_project_service.api["composer.googleapis.com"] will be destroyed
  # (because module.composer is not in configuration)
  - resource "google_project_service" "api" {
      - disable_on_destroy = false -> null
      - id                 = "tbd-2024l-3108510/composer.googleapis.com" -> null
      - project            = "tbd-2024l-3108510" -> null
      - service            = "composer.googleapis.com" -> null
    }

  # module.composer.google_service_account.tbd-composer-sa will be destroyed
  # (because module.composer is not in configuration)
  - resource "google_service_account" "tbd-composer-sa" {
      - account_id = "tbd-2024l-3108510-data" -> null
      - disabled   = false -> null
      - email      = "tbd-2024l-3108510-data@tbd-2024l-3108510.iam.gserviceaccount.com" -> null
      - id         = "projects/tbd-2024l-3108510/serviceAccounts/tbd-2024l-3108510-data@tbd-2024l-3108510.iam.gserviceaccount.com" -> null
      - member     = "serviceAccount:tbd-2024l-3108510-data@tbd-2024l-3108510.iam.gserviceaccount.com" -> null
      - name       = "projects/tbd-2024l-3108510/serviceAccounts/tbd-2024l-3108510-data@tbd-2024l-3108510.iam.gserviceaccount.com" -> null
      - project    = "tbd-2024l-3108510" -> null
      - unique_id  = "110057348112559728689" -> null
    }

  # module.data-pipelines.google_storage_bucket.tbd-code-bucket will be destroyed
  # (because module.data-pipelines is not in configuration)
  - resource "google_storage_bucket" "tbd-code-bucket" {
      - default_event_based_hold    = false -> null
      - effective_labels            = {} -> null
      - enable_object_retention     = false -> null
      - force_destroy               = true -> null
      - id                          = "tbd-2024l-3108510-code" -> null
      - labels                      = {} -> null
      - location                    = "EUROPE-WEST1" -> null
      - name                        = "tbd-2024l-3108510-code" -> null
      - project                     = "tbd-2024l-3108510" -> null
      - public_access_prevention    = "enforced" -> null
      - requester_pays              = false -> null
      - self_link                   = "https://www.googleapis.com/storage/v1/b/tbd-2024l-3108510-code" -> null
      - storage_class               = "STANDARD" -> null
      - terraform_labels            = {} -> null
      - uniform_bucket_level_access = false -> null
      - url                         = "gs://tbd-2024l-3108510-code" -> null

      - soft_delete_policy {
          - effective_time             = "2024-05-23T14:15:14.332Z" -> null
          - retention_duration_seconds = 604800 -> null
        }

      - versioning {
          - enabled = true -> null
        }
    }

  # module.data-pipelines.google_storage_bucket.tbd-data-bucket will be destroyed
  # (because module.data-pipelines is not in configuration)
  - resource "google_storage_bucket" "tbd-data-bucket" {
      - default_event_based_hold    = false -> null
      - effective_labels            = {} -> null
      - enable_object_retention     = false -> null
      - force_destroy               = true -> null
      - id                          = "tbd-2024l-3108510-data" -> null
      - labels                      = {} -> null
      - location                    = "EUROPE-WEST1" -> null
      - name                        = "tbd-2024l-3108510-data" -> null
      - project                     = "tbd-2024l-3108510" -> null
      - public_access_prevention    = "enforced" -> null
      - requester_pays              = false -> null
      - self_link                   = "https://www.googleapis.com/storage/v1/b/tbd-2024l-3108510-data" -> null
      - storage_class               = "STANDARD" -> null
      - terraform_labels            = {} -> null
      - uniform_bucket_level_access = false -> null
      - url                         = "gs://tbd-2024l-3108510-data" -> null

      - soft_delete_policy {
          - effective_time             = "2024-05-23T14:15:14.630Z" -> null
          - retention_duration_seconds = 604800 -> null
        }

      - versioning {
          - enabled = true -> null
        }
    }

  # module.data-pipelines.google_storage_bucket_iam_member.tbd-code-bucket-iam-viewer will be destroyed
  # (because module.data-pipelines is not in configuration)
  - resource "google_storage_bucket_iam_member" "tbd-code-bucket-iam-viewer" {
      - bucket = "b/tbd-2024l-3108510-code" -> null
      - etag   = "CAI=" -> null
      - id     = "b/tbd-2024l-3108510-code/roles/storage.objectViewer/serviceAccount:tbd-2024l-3108510-data@tbd-2024l-3108510.iam.gserviceaccount.com" -> null
      - member = "serviceAccount:tbd-2024l-3108510-data@tbd-2024l-3108510.iam.gserviceaccount.com" -> null
      - role   = "roles/storage.objectViewer" -> null
    }

  # module.data-pipelines.google_storage_bucket_iam_member.tbd-data-bucket-iam-editor will be destroyed
  # (because module.data-pipelines is not in configuration)
  - resource "google_storage_bucket_iam_member" "tbd-data-bucket-iam-editor" {
      - bucket = "b/tbd-2024l-3108510-data" -> null
      - etag   = "CAI=" -> null
      - id     = "b/tbd-2024l-3108510-data/roles/storage.objectUser/serviceAccount:tbd-2024l-3108510-data@tbd-2024l-3108510.iam.gserviceaccount.com" -> null
      - member = "serviceAccount:tbd-2024l-3108510-data@tbd-2024l-3108510.iam.gserviceaccount.com" -> null
      - role   = "roles/storage.objectUser" -> null
    }

  # module.data-pipelines.google_storage_bucket_object.job-code["spark-job.py"] will be destroyed
  # (because module.data-pipelines is not in configuration)
  - resource "google_storage_bucket_object" "job-code" {
      - bucket           = "tbd-2024l-3108510-code" -> null
      - content_type     = "text/plain; charset=utf-8" -> null
      - crc32c           = "anSXug==" -> null
      - detect_md5hash   = "ldH89cRRBUXH2DBBw3SgVA==" -> null
      - event_based_hold = false -> null
      - id               = "tbd-2024l-3108510-code-spark-job.py" -> null
      - md5hash          = "ldH89cRRBUXH2DBBw3SgVA==" -> null
      - media_link       = "https://storage.googleapis.com/download/storage/v1/b/tbd-2024l-3108510-code/o/spark-job.py?generation=1716473715609925&alt=media" -> null
      - metadata         = {} -> null
      - name             = "spark-job.py" -> null
      - output_name      = "spark-job.py" -> null
      - self_link        = "https://www.googleapis.com/storage/v1/b/tbd-2024l-3108510-code/o/spark-job.py" -> null
      - source           = "modules/data-pipeline/resources/spark-job.py" -> null
      - storage_class    = "STANDARD" -> null
      - temporary_hold   = false -> null
    }

  # module.gcr.google_artifact_registry_repository.registry will be updated in-place
  ~ resource "google_artifact_registry_repository" "registry" {
        id                     = "projects/tbd-2024l-3108510/locations/europe/repositories/eu.gcr.io"
        name                   = "eu.gcr.io"
        # (12 unchanged attributes hidden)

      ~ docker_config {
          ~ immutable_tags = true -> false
        }
    }

  # module.jupyter_docker_image.docker_image.jupyter will be created
  + resource "docker_image" "jupyter" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "eu.gcr.io/tbd-2024l-3108510/jupyter:4.1.6"
      + repo_digest = (known after apply)
      + triggers    = {
          + "dir_sha1" = "9ce1fe5afa895f2607bc62b5dcf78a071c008210"
        }

      + build {
          + build_args   = {
              + "DBT_SPARK_VERSION"     = "1.7.1"
              + "DBT_VERSION"           = "1.7.13"
              + "GCS_CONNECTOR_VERSION" = "2.2.17"
              + "JUPYTERLAB_VERSION"    = "4.1.6"
              + "PROJECT_NAME"          = "tbd-2024l-3108510"
              + "SPARK_VERSION"         = "3.3.2"
            }
          + cache_from   = []
          + context      = "modules/jupyter_docker_image/resources"
          + dockerfile   = "Dockerfile"
          + extra_hosts  = []
          + remove       = true
          + security_opt = []
          + tag          = [
              + "eu.gcr.io/tbd-2024l-3108510/jupyter:latest",
            ]
        }
    }

  # module.jupyter_docker_image.docker_registry_image.jupyterlab must be replaced
-/+ resource "docker_registry_image" "jupyterlab" {
      ~ id                   = "sha256:552f07fdd6817ed60003f8a7a91dd008a5d60127b76147977d251bd6e8d20f35" -> (known after apply)
      ~ name                 = "eu.gcr.io/tbd-2024l-3108510/jupyter:3.6.3" -> "eu.gcr.io/tbd-2024l-3108510/jupyter:4.1.6" # forces replacement
      ~ sha256_digest        = "sha256:552f07fdd6817ed60003f8a7a91dd008a5d60127b76147977d251bd6e8d20f35" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha1" = "0ae070775d3102ba9dae4391e78e62e46185e752" -> "9ce1fe5afa895f2607bc62b5dcf78a071c008210"
        }
        # (2 unchanged attributes hidden)
    }

  # module.jupyter_mlops_docker_image.docker_image.jupyter-mlops will be created
  + resource "docker_image" "jupyter-mlops" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "eu.gcr.io/tbd-2024l-3108510/jupyter-mlops:4.1.6"
      + repo_digest = (known after apply)
      + triggers    = {
          + "dir_sha1" = "071e310a8b749a8859942cddb203482620c7d078"
        }

      + build {
          + build_args   = {
              + "DBT_SPARK_VERSION"     = "1.7.1"
              + "DBT_VERSION"           = "1.7.13"
              + "GCS_CONNECTOR_VERSION" = "2.2.17"
              + "JUPYTERLAB_VERSION"    = "4.1.6"
              + "KEDRO_VERSION"         = "0.19.5"
              + "MLFLOW_VERSION"        = "2.12.2"
              + "PROJECT_NAME"          = "tbd-2024l-3108510"
              + "SPARK_VERSION"         = "3.3.2"
              + "VS_CODE_VERSION"       = "4.23.1"
            }
          + cache_from   = []
          + context      = "modules/jupyter_mlops_docker_image/resources"
          + dockerfile   = "Dockerfile"
          + extra_hosts  = []
          + remove       = true
          + security_opt = []
          + tag          = [
              + "eu.gcr.io/tbd-2024l-3108510/jupyter-mlops:latest",
            ]
        }
    }

  # module.jupyter_mlops_docker_image.docker_registry_image.jupyterlab will be created
  + resource "docker_registry_image" "jupyterlab" {
      + id                   = (known after apply)
      + insecure_skip_verify = false
      + keep_remotely        = true
      + name                 = "eu.gcr.io/tbd-2024l-3108510/jupyter-mlops:4.1.6"
      + sha256_digest        = (known after apply)
      + triggers             = {
          + "dir_sha1" = "071e310a8b749a8859942cddb203482620c7d078"
        }
    }

  # module.vertex_ai_workbench.data.google_project.project will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + effective_labels    = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "tbd-2024l-3108510"
      + skip_delete         = (known after apply)
      + terraform_labels    = (known after apply)
    }

  # module.vertex_ai_workbench.google_notebooks_instance.tbd_notebook must be replaced
-/+ resource "google_notebooks_instance" "tbd_notebook" {
      ~ create_time            = "2024-05-23T14:22:01.158857357Z" -> (known after apply)
      ~ disk_encryption        = "GMEK" -> (known after apply)
      ~ effective_labels       = {
          - "goog-caip-notebook" = ""
        } -> (known after apply)
      ~ id                     = "projects/tbd-2024l-3108510/locations/europe-west1-b/instances/tbd-2024l-3108510-notebook" -> (known after apply)
      - install_gpu_driver     = false -> null
      - labels                 = {} -> null
        name                   = "tbd-2024l-3108510-notebook"
      ~ network                = "https://www.googleapis.com/compute/v1/projects/tbd-2024l-3108510/global/networks/main-vpc" -> "projects/tbd-2024l-3108510/global/networks/main-vpc"
      + proxy_uri              = (known after apply)
      ~ service_account        = "577259952691-compute@developer.gserviceaccount.com" -> (known after apply)
      ~ service_account_scopes = [
          - "https://www.googleapis.com/auth/cloud-platform",
          - "https://www.googleapis.com/auth/userinfo.email",
        ] -> (known after apply)
      ~ state                  = "ACTIVE" -> (known after apply)
      ~ subnet                 = "https://www.googleapis.com/compute/v1/projects/tbd-2024l-3108510/regions/europe-west1/subnetworks/subnet-01" -> "projects/tbd-2024l-3108510/regions/europe-west1/subnetworks/subnet-01"
      ~ tags                   = [
          - "deeplearning-vm",
          - "notebook-instance",
        ] -> (known after apply)
      ~ terraform_labels       = {} -> (known after apply)
      ~ update_time            = "2024-05-23T14:26:15.450258832Z" -> (known after apply)
        # (9 unchanged attributes hidden)

      ~ container_image {
          ~ repository = "eu.gcr.io/tbd-2024l-3108510/jupyter" -> "eu.gcr.io/tbd-2024l-3108510/jupyter-mlops" # forces replacement
          ~ tag        = "3.6.3" -> "4.1.6" # forces replacement
        }

      - shielded_instance_config {
          - enable_integrity_monitoring = true -> null
          - enable_secure_boot          = false -> null
          - enable_vtpm                 = true -> null
        }
    }

  # module.vertex_ai_workbench.google_project_iam_binding.token_creator_role will be updated in-place
  ~ resource "google_project_iam_binding" "token_creator_role" {
        id      = "tbd-2024l-3108510/roles/iam.serviceAccountTokenCreator"
      ~ members = [
          - "serviceAccount:577259952691-compute@developer.gserviceaccount.com",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.vertex_ai_workbench.google_storage_bucket_iam_binding.binding will be updated in-place
  ~ resource "google_storage_bucket_iam_binding" "binding" {
        id      = "b/tbd-2024l-3108510-conf/roles/storage.objectViewer"
      ~ members = [
          - "serviceAccount:577259952691-compute@developer.gserviceaccount.com",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.vertex_ai_workbench.google_storage_bucket_object.post-startup must be replaced
-/+ resource "google_storage_bucket_object" "post-startup" {
      + content          = (sensitive value)
      ~ content_type     = "text/plain; charset=utf-8" -> (known after apply)
      ~ crc32c           = "Ap4QVQ==" -> (known after apply)
      ~ detect_md5hash   = "GTLA9JWFwX3cNNviG47JXg==" -> "different hash" # forces replacement
      - event_based_hold = false -> null
      ~ id               = "tbd-2024l-3108510-conf-scripts/notebook_post_startup_script.sh" -> (known after apply)
      + kms_key_name     = (known after apply)
      ~ md5hash          = "GTLA9JWFwX3cNNviG47JXg==" -> (known after apply)
      ~ media_link       = "https://storage.googleapis.com/download/storage/v1/b/tbd-2024l-3108510-conf/o/scripts%2Fnotebook_post_startup_script.sh?generation=1716474118310107&alt=media" -> (known after apply)
      - metadata         = {} -> null
        name             = "scripts/notebook_post_startup_script.sh"
      ~ output_name      = "scripts/notebook_post_startup_script.sh" -> (known after apply)
      ~ self_link        = "https://www.googleapis.com/storage/v1/b/tbd-2024l-3108510-conf/o/scripts%2Fnotebook_post_startup_script.sh" -> (known after apply)
      ~ storage_class    = "STANDARD" -> (known after apply)
      - temporary_hold   = false -> null
        # (2 unchanged attributes hidden)
    }

  # module.composer.module.composer.google_project_iam_member.composer_agent_service_account[0] will be destroyed
  # (because module.composer.module.composer is not in configuration)
  - resource "google_project_iam_member" "composer_agent_service_account" {
      - etag    = "BwYZH8YrAGs=" -> null
      - id      = "tbd-2024l-3108510/roles/composer.ServiceAgentV2Ext/serviceAccount:service-577259952691@cloudcomposer-accounts.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:service-577259952691@cloudcomposer-accounts.iam.gserviceaccount.com" -> null
      - project = "tbd-2024l-3108510" -> null
      - role    = "roles/composer.ServiceAgentV2Ext" -> null
    }

Plan: 6 to add, 3 to change, 15 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "iac_service_account" but a
value was found in file "env/project.tfvars". If you meant to use this value,
add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Deprecated Resource

  with module.vertex_ai_workbench.google_notebooks_instance.tbd_notebook,
  on modules/vertex-ai-workbench/main.tf line 49, in resource "google_notebooks_instance" "tbd_notebook":
  49: resource "google_notebooks_instance" "tbd_notebook" {

`google_notebook_instance` is deprecated and will be removed in a future
major release. Use `google_workbench_instance` instead.

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @mwiewior, Action: `pull_request`, Working Directory: ``, Workflow: `Tech Tests`*